In [15]:
import pandas as pd

names = pd.Series(['Austine', 'Audrey', 'Tuazon'], index=['a', 'b', 'c'])
names_two = pd.Series(['Feeniks', 'Maria', 'Gabriella'], index=['c', 'b', 'a'])

print(names + names_two)

a    AustineGabriella
b         AudreyMaria
c       TuazonFeeniks
dtype: object

In [16]:
data = {
    'Name': ['Alice', 'Penny', 'Rakuzan'],
    'Age': [22, 12, 15]
}

data

df = pd.DataFrame(data)

df

      Name  Age
0    Alice   22
1    Penny   12
2  Rakuzan   15

In [23]:
df.head(2)

    Name  Age
0  Alice   22
1  Penny   12

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [19]:
print(df['Name'])
print(df['Age'])

0      Alice
1      Penny
2    Rakuzan
Name: Name, dtype: object
0    22
1    12
2    15
Name: Age, dtype: int64

In [20]:
df.loc[df['Age'] < 20]['Name']

1      Penny
2    Rakuzan
Name: Name, dtype: object

In [ ]:
data_frame = pd.DataFrame({
    "Name": ["Ana", "Ben", "Cara", "Dan"],
    "Age": [23, 30, 27, 22],
    "City": ["Manila", "Cebu", "Davao", "Manila"]
})

data_frame[['Name', 'Age']]

   Name  Age
0   Ana   23
1   Ben   30
2  Cara   27
3   Dan   22

In [68]:
data_frame.loc[0:2, ['Name']]

   Name
0   Ana
1   Ben
2  Cara